1:WizQst1615E5
00000000

Don't go into that tunnel. Don't go after the Sphinx. It's just too confusing.
00000001

Are you going after the Sphinx? We done tried that, my fellow hunters and I. It went badly.
00000002

That Sphinx is a monster... a demon... it attacked us with... RIDDLES! It speaks in your mind with hideous brainteasers, thought-melters.
00000003

The headaches, I thought they'd never end. Not from the telepathy, but from those riddles. They're almost more than a mortal mind can bear.
00000004

Don't venture into that cavern, Wizard, for your own sanity. Forget my fellow hunters, they're all but lost.
00000005

Oh, someone else has come to play Empyrea's favorite game: The Riddle of the Sphinx! Let's hear it for them everybody.
00000006

The rules are simple. Find me and answer my riddle to win a fabulous prize: the rest of your life. Sounds easy, right?
00000007

It is easy, too easy. That's why I added a new wrinkle. To reach me, you must first make it through a few qualifying rounds. Yeah!
00000008

"Dwarves, dwarves, dwarves. Oh, how they love their wars. No mission stops, no calling halts, them marshalling their force."
00000009

I won't say it.
00000010

You have to or it will punish us again. You know it will.
00000011

Fiiine. "Ack, oh you, our icy brothers, it's by our hand you'll suffer, for these your threats and our life debts. We Fire Dwarves are tougher!"
00000012

Oh, that's bad. I mean, uh, "You fiendish, fiery foes. There's much that you don't knows. And now our icy spells will nip right at your toes."
00000013

Ugh, so we fight the Wizard now, right? Good. No script for that part. Sorry, kid.
00000014

Well, thank Raven that's over. It's bad enough we have to relive the Athanor War forever... but, I mean, was it really this cheesy?
00000015

Oh, but this isn't even close to over. Nor have we approached peak cheese. You Aero Dwarves still have much to answer for.
00000016

Continue on, Wizard, time for Round 2 of Empyrea's favorite game: The Riddle of the Sphinx.
00000017

"The war raged between Fire and Ice. But some decided that's not so nice. And so they fled, they left instead, and came to this new homestead."
00000018

"Listen my fellows, my neighbors, my friends, we can't just keep fighting again and again."
00000019

"Concurred! Agreed! But what can be done? The leaders won't stop with the war yet unwon."
00000020

"It's time we left. Let's take to the air, and hope we find some sanctuary there!"
00000021

Oh, look, a snoop and something, something, something, let's go... fight it and... uh... smash it to goop.
00000022

"It's violence like this that really must end. So let us fly off and start again." "Both ice and fire, I suggest we be neither."
00000023

"And take a new name to reflect our new course. From this moment on, we are Aero Dwarves!"
00000024

Good grief. Blah, blah, blah, crashed on Neumia. Blah, blah, blah, stayed here. Blah... AHHHH!
00000025

Oh, and he's out of there! One contestant eliminated. Time for the lightning round. Let's see who makes it out alive.
00000026

"And now at last the final act. The Aero Dwarves broke their Ravenly pact, forsaking the chain on Athanor, all because of some measly war."
00000027

"Their guilt, it built across the ages, until the Raven-Child broke the Athanor links; and created I, the mighty Sphinx."
00000028

Well, there you have it, the story of the Aero Dwarves' betrayal of Raven, one they will relive forever and ever. Unless, you can win the game.
00000033

You survived? By the currents, Wizard, I can't believe it, you got all my companions back...
00000034

...Even if they are in those crazy get-ups. Bah, being an Ice or Fire Dwarf again, that's almost more terrifying than the Sphinx.
00000035

But anyhow, you say Constance sent you? Yeah, she's always fussin', that one. Head back to Velo City and tell her we're okay.
00000036

So the Hunters did create the Sphinx? I knew they would. And it told riddles? That's darned peculiar. 
00000037

But then the Hunters Guild always were more brawn than brain, so maybe their own insecurity about their intelligence tinted the myth a bit.
00000038

It's a strange world, Wizard, but we've made it our own and I wouldn't have it any other way.
00000039

into the Cavern
00000040

Well, that was fun, but the game is done and the Wizard's won.
00000041

Guess I'll be off then. But I'll always be around, in the back of your minds, listening for the slightest guilt, the tiniest confusion, to strike!
00000042

I don't get it. What just happened?
00000043

The Wizard solved the riddle, thunderhead. The answer was battle.
00000044

That don't make a lick of sense. But I don't care. Let's get out of this hole.
00000045

Just solve my riddle and you'll win a brand new continued existence. Fail and it's game over. So here it is, the Riddle of the Sphinx:
00000046

"I'm the solution to this and I'm really not fancy. I'm neither talking, nor puzzles, nor strange photomancy.
00000047

I'm the one thing that all Wizards do, or they die; I'm the only way you're getting past this guy. So, show me now, what am I?"
00000048

the Sphinx's Cavern
00000049

to Round 2
00000050

the Final Round
